#+Title: Reproducible Research
#+Author: Simin Yazdandoust
#+Email: cminyazdan95@gmail.com

#+OPTIONS: reveal_center:t reveal_progress:t reveal_history:nil reveal_control:t
#+OPTIONS: reveal_mathjax:t
#+REVEAL_MATHJAX_URL: MathJax/unpacked/MathJax.js?config=TeX-AMS-MML_HTMLorMML
#+OPTIONS: reveal_width:1200 reveal_height:800
#+OPTIONS: email:t num:nil toc:nil timestamp:nil
#+REVEAL_MARGIN: 0.1
#+REVEAL_MIN_SCALE: 0.5
#+REVEAL_MAX_SCALE: 2.5
#+REVEAL_TRANS: concave
#+REVEAL_THEME: serif
#+REVEAL_HLEVEL: 1
#+REVEAL_EXTRA_CSS: ./css/stylesheet.css
#+REVEAL_HEAD_PREAMBLE: <meta name="description" content="An Introduction to Reproducible Research">

** Source code example
   $$ \int _0^1 e^{e^x} dx $$
   #+BEGIN_SRC python :results output :exports both :cache yes
     from random import random
     import math

     def approx(total):
         succ = 0
         for i in range(total):
             x, y = random(), random() * 27
             if y < math.exp(math.exp(x)):
                 succ += 1
         return (succ/total) * 27

     print(approx(10000000))
   #+END_SRC

   #+RESULTS[c2f35a05ba2c844be07ceb36e3e496524dca887c]:
   : 6.3152919

* Configuration                                                    :noexport:
# Local Variables:
# org-latex-to-pdf-process: (xelatex -shell-escape -interaction nonstopmode -output-directory %o %f "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f")
# org-startup-with-inline-images: nil
# End:

#+BEGIN_SRC elisp :exports none
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((octave . t)))
  (setq org-latex-pdf-process
        (quote ("xelatex -shell-escape -interaction nonstopmode -output-directory %o %f"
                "biber %b"
                "xelatex -shell-escape -interaction nonstopmode -output-directory %o %f")))
  (add-to-list 'org-latex-packages-alist '("" "minted" nil))
  (setq org-latex-listings 'minted)

  (setq org-latex-minted-options
        '(("frame" "leftline")
          ("fontsize" "\\scriptsize")
          ("stepnumber" "1")
          ("mathescape" "true")
          ("linenos" "true")))
#+END_SRC

#+RESULTS:
| frame      | leftline    |
| fontsize   | \scriptsize |
| stepnumber | 1           |
| mathescape | true        |
| linenos    | true        |
